app/Models/ModelSekolah.php

SELECT *
FROM `tbl_kampus`
WHERE `id` = 1
---
    public function DetailData()
    {
        return $this->db->table('tbl_kampus')
            ->where('id', 1)
            ->get()
            ->getRowArray();