app/Models/ModelJurusan.php

SELECT *
FROM `tbl_prodi`
---
    public function AllData()
    {
        return $this->db->table('tbl_prodi')->get()->getResultArray();