app/Models/ModelDosen.php

SELECT *
FROM `tbl_dosen`
ORDER BY `ID_dosen` DESC
---
    public function AllData()
    {
        return $this->db->table('tbl_dosen')
            ->orderBy('ID_dosen', 'DESC')
            ->get()->getResultArray();