app/Models/ModelRuang.php

SELECT *
FROM `tbl_ruang`
---
    public function AllData()
    {
        return $this->db->table('tbl_ruang')->get()->getResultArray();

UPDATE `tbl_ruang` SET `id_ruang` = '4', `kode_ruang` = 'A104', `nama_ruang` = 'Ruang '
WHERE `id_ruang` = '4'
---
    public function UpdateData($id_ruang, $data)
{
    return $this->db->table('tbl_ruang')
        ->where('id_ruang', $id_ruang)
        ->update($data);